import React from 'react';
import firebase from './index';
const WordsAdd = () => {
  let videos=[
      {
        id:'2g_zdC0I-CA',
        title:'बिद्युत प्राधिकरण डरायो ! सुचना माग्दा लुकाउछ ! पोखरा नया बिमानस्थल कस्तो ? जहाज उड्नै नदिने चेतावनी',
        runtime:'3119',
        datepublished:'2021-03-26',
      },
      {
        id:'FmUMhUrhOHg',
        title:'निमुखा जनतामाथी प्रहरीको दादागिरी ! महानगरमा तनाव | प्रहरी मेरो साथी कि सत्रु ?..र यि बृद्धाको आशु..',
        runtime:'1892',
        datepublished:'2021-03-19',
      },
      {
        id:'JY6Ul3iervw',
        title:'संकटमा क्रिकेट रंगशाला !धुर्मुस भन्छन–हिम्मत हारेको छैन |रंगशालामा अपिल पुग्दा.. सिचाइ कार्यालय लफडा',
        runtime:'2916',
        datepublished:'2021-03-12',
      },
      {
        id:'2fIW5FTknCc',
        title:'फेवातालमा छड्के ! खै फेवा ताल ? ताल किनारमा चर्काचर्की ! वास्तबिकता कि सेटीङ ? क्षेत्रफल लफडाको चुरो',
        runtime:'2069',
        datepublished:'2021-03-05',
      },
      {
        id:'hqy7LJD5BWA',
        title:'खोलामा करोडको ‘कालो धन्दा’ ! हामी पुगेपछी भयो भागाभाग ! दादागिरी कि सरकारी लाचारी ? सेटीङ के हो ?',
        runtime:'2518',
        datepublished:'2021-02-26',
      },
      {
        id:'ZnG6jPXzwyM',
        title:'प्रहरीको पर्दाफास : सधै घुसको लेनदेन ? प्रहरी र ठेकदार लफडा | प्रबक्ता भन्छन : त्यस्तालाई छाड्दैनौ |',
        runtime:'2320',
        datepublished:'2021-02-19',
      },
      {
        id:'0mYaO2O3S2o',
        title:'प्रहरीको लापरवाही :२ भाइले यसरी घुमाइदिए प्रहरीलाई | स्कुलमा किचलो, मारमा बिद्यार्थी किन हुदैन कक्षा',
        runtime:'3107',
        datepublished:'2021-02-12',
      },
      {
        id:'A7j8Ws8GGks',
        title:'शिक्षकलाई कालोमोसो, परीक्षा अनियमितता प्रकरण : के भन्दैछन शिक्षक ? १० बर्षदेखी छोराको खोजीमा बाबुआमा',
        runtime:'46',
        datepublished:'2021-01-29',
      },
      {
        id:'YaE7NRUVz0s',
        title:'शिक्षकको बदमासीको पर्दाफास : स्कुलमा लफडा | छात्रालाई होटल लगेर परीक्षा लिने शिक्षक पक्राउ',
        runtime:'45',
        datepublished:'2021-01-22',
      },
      {
        id:'SWDYIzvm7-A',
        title:'९ अर्बको भ्रष्टाचार ? अन्तरवार्तामा जंगिए बाबुराम भट्टराई ! जि न्युजले यस्तो सम्म भनेको थियो ओलीलाई',
        runtime:'38',
        datepublished:'2021-01-15',
      },
      {
        id:'9k_bOQiO--A',
        title:'शिक्षकले परीक्षा लिन यसरी होटल पु¥याए छात्रालाई | भन्छन–गल्ती भयो, माफ पाउ | क-कसको छ मिलेमतो ?',
        runtime:'44',
        datepublished:'2021-01-08',
      },
      {
        id:'6b79Ofn8y2Q',
        title:'बिप्लवका छोरा प्रकाशलाई भारतबाट ध म्की ! उर्जा मन्त्रीसंग चर्काचर्की : कुलमानलाई नियुक्ति किन नदिने?',
        runtime:'45',
        datepublished:'2021-01-01',
      },
      {
        id:'FrZ9MZ7Z8Lg',
        title:'३ नेताहरुसंग चर्काचर्की बहस | ओली गलत कि प्रचण्ड र माधव ? अब के हुन्छ? गण्डकी छड्के संसद बिघटन बिशेष',
        runtime:'47',
        datepublished:'2020-12-25',
      },
      {
        id:'EKpA9jfHJ3c',
        title:'पोखरामा पार्किङको लफडा | रातमा सडकका खाल्डा पु¥दै अपिल | बिप्लव पार्टीका नेताको रहस्यमय मरण ?',
        runtime:'59',
        datepublished:'2020-12-19',
      },
      {
        id:'U4UIAgFh6Ac',
        title:'बिद्युतका हाकीम घुस लिदालिदै रंगेहात ! यसरी भयो स्टिङ अपरेशन | परे पक्राउ | नेपालले नाप्यो सगरमाथा',
        runtime:'31',
        datepublished:'2020-12-11',
      },
      {
        id:'r2xPvtLDMRY',
        title:'प्रहरीको अनौठो अभियान I Love You बुढी ! तनहु प्रकरण: रामचन्द्र पौडेल र पक्राउ गर्ने CDO के भन्छन ?',
        runtime:'43',
        datepublished:'2020-12-04',
      },
      {
        id:'2lh4NikyY2Q',
        title:'दिपक मनाङेकी श्रीमती पक्राउ | मनाङे भन्छन–गल्ती गर्ने कसैलाई छोड्दीन।राजाबादी कार्यक्रमको रहस्य के?',
        runtime:'46',
        datepublished:'2020-11-28',
      },
      {
        id:'AvztKcWrvkc',
        title:'संक्रमणले ढलेका डाक्टरको कहाली लाग्दो अनुभव | सरकारी गाडीमा यस्तो रजाई ! संक्रमण जित्दा ११ लाख चैट !',
        runtime:'40',
        datepublished:'2020-11-20',
      },
      {
        id:'chlSULMTQxk',
        title:'बिप्लवका छोरा प्रकाश र दुर्गा प्रसाई बिच चर्काचर्की |कारवाही गर्ने प्रकाशको चेतावनी, के भन्छन प्रसाई',
        runtime:'47',
        datepublished:'2020-11-13',
      },
      {
        id:'HeTzt04eCJE',
        title:'अर्को डरलाग्दो खुलासा ! कसरी हुन्छ उपचार ? हेर्नुहोस अस्पतालहरुको अवस्था |खै ICU ? मुख्यमन्त्री कता',
        runtime:'45',
        datepublished:'2020-11-06',
      },
      {
        id:'pX4mEbUNUpU',
        title:'एउटा डरलाग्दो खुलासा ! अब म*र्ने बाहेक बिकल्प छैन ? सरकारको तयारीको असली रुप |संक्रमण र बास्ताबिकता',
        runtime:'42',
        datepublished:'2020-10-30',
      },
      {
        id:'hwx9o3P9UU4',
        title:'यसरी सिधै घुस माग्छन कर्मचारी ! हेर्नुहोस यस्ता छन बाहाना | पोखरामा बढ्यो चो*री, के गर्दैछ प्रहरी ?',
        runtime:'43',
        datepublished:'2020-10-23',
      },
      {
        id:'pysKgUtIAb0',
        title:'जेल भित्र बाट आयो ध*म्की ! अस्पतालबाटै बिरामी गायब | दशैमा लकडाउन हुदैछ? मुख्यमन्त्री संग सिधा सवाल',
        runtime:'39',
        datepublished:'2020-10-26',
      },
      {
        id:'80Fy-dHLJy4',
        title:'सरकारी सम्पत्तीमा कर्मचारीको रजाई ! लाज कहा पच्यो महोदय ? यि हुन अटेरी कर्मचारी, CDO लाई नै टेर्दैनन',
        runtime:'43',
        datepublished:'2020-10-09',
      },
      {
        id:'aZ38SNTMDbU',
        title:'अपिल त्रिपाठी बिरुद्ध सर्वोच्च अदालतमा मुद्वा दर्ता | अब के हुन्छ ? खानेपानी लेखनाथ कार्यालयमा लफडा',
        runtime:'33',
        datepublished:'2020-10-02',
      },
      {
        id:'MQg2fCSayQA',
        title:'बोडिङ स्कुलको भण्डाफोर ! पैसा असुल्ने यस्तो धन्दा ? यो बाटो नै रोक्ने को हो ‘शक्तिमान’ ?',
        runtime:'49',
        datepublished:'2020-09-25',
      },
      {
        id:'ocYkN81CNMU',
        title:'खानेपानीमा कार्यालयमा ‘छड्के’ ! घुस सहीत रंगेहातको काहानी | यसरी गर्छन कर्मचारीले भ्रष्टाचार ।',
        runtime:'44',
        datepublished:'2020-09-18',
      },
      {
        id:'s0dSIYAeA50',
        title:'घुस लिदा लिदै खानेपानीका कर्मचारी यसरी रंगेहात ! आँखा अस्पतालमै के भयो यस्तो ? को सही, को गलत ?',
        runtime:'67',
        datepublished:'2020-09-11',
      },
      {
        id:'GjDEhIFRIss',
        title:'कुलमान बारेको बास्तबिकता ! मन्त्रीले कस्लाई भने मुर्ख ? मुख्यमन्त्री, मन्त्री, मेयर, डाक्टरसम्म :बहस',
        runtime:'50',
        datepublished:'2020-08-28',
      },
      {
        id:'K7hvZuGcK6Q',
        title:'यो दादागिरी ? कि सरकारी लाचारी ? मन्त्री र मेयर संग चर्काचर्की ! खोलामा ‘अबैध धन्दा’ कहिले सम्म ?',
        runtime:'51',
        datepublished:'2020-08-21',
      },
      {
        id:'7b3BgNGT0x8',
        title:'महामारीमा यसरी पैसा असुल्दै बोडिङ स्कुल ? स्कुल खोल्ने को ? जिम्मा लिने को ? CDO र मेयरको यस्तो जवाफ',
        runtime:'51',
        datepublished:'2020-08-14',
      },
      {
        id:'pS-TVDyPDYg',
        title:'१३ करोड हरायो ! कसरी भयो गायब ? इजाजत नै नलिइ यि महिलाको अबैध कारोबार ? महानगरमाथी गम्भीर प्रश्न !',
        runtime:'50',
        datepublished:'2020-08-08',
      },
      {
        id:'aB1FeTEvP7M',
        title:'सरकारी स्कुलको डामाडोलको भण्डाफोर ! हेडसर र अध्यक्षसंग चर्काचर्की ! ६४ लाख बजेटमा मनपरी ?',
        runtime:'51',
        datepublished:'2020-07-31',
      },
      {
        id:'BcKmUMAqK1A',
        title:'गरीब बस्तीमा सरकारको गुण्डा शैलीमा दादागिरी ! मेयर र वाडेनसंग चर्काचर्की ।घर जला-इयो,अन्नबाली नासियो',
        runtime:'43',
        datepublished:'2020-07-25',
      },
      {
        id:'DjnR-5iAstM',
        title:'१ लाख घुस सहीत इन्जीनियर रंगेहात ! डेट सकिएको औषधी बेच्ने यो फार्मेसी । ३ करोड ५ लाख काण्डको फलोअप |',
        runtime:'40',
        datepublished:'2020-07-17',
      },
      {
        id:'C4pEpjZc5Tk',
        title:'३ करोड ५ लाख काण्ड ! महानगरमा खैलाबैला । अख्तियार पनी आयो । मेयर गर्जिए– कारवाही गर्छु, जो भए पनी',
        runtime:'46',
        datepublished:'2020-07-10',
      },
      {
        id:'48BSCTFEOCA',
        title:'पोखरा महानगरमा छड्के ! ३ करोड ५ लाख रुपैया खोइ ?कर्मचारीहरुको यस्तो अनियमितता, कारवाही कसलाई कस्ले',
        runtime:'36',
        datepublished:'2020-07-03',
      },
      {
        id:'AetlUBTGY_I',
        title:'कोरोना संक्रमित अस्पतालबाट अनुहार नै देखाएर LIVE। क्वारेन्टाइन बाटै कोरोना लाग्छ, बरु घरमै बसे ठिक',
        runtime:'26',
        datepublished:'2020-06-27',
      },
      {
        id:'XMpot8besNY',
        title:'म मुर्ख हु : महाबिर पुन संग रोचक अन्तरवार्ता। पुरस्कार दिनेहरुले हैरान बनाए, कसैसंग दान मागेको होइन',
        runtime:'33',
        datepublished:'2020-06-19',
      },
      {
        id:'0hgWYqXzbIY',
        title:'खोलामा ‘अबैध धन्दा’ ? सामान गायब, हामी पुगेपछी यसरी रोकियो । पोखराको क्वारेन्टाइनमा पुग्दा..यस्तो छ',
        runtime:'25',
        datepublished:'2020-06-05',
      },
      {
        id:'jP4UfnqNVeE',
        title:'चुरोट बन्द गर्न अनशन ! लकडाउनमा जनतालाई भाटे कारवाही, चुरोट उद्योग चालु ? CDOलाई प्रश्न :के तमाशा हो',
        runtime:'32',
        datepublished:'2020-05-22',
      },
      {
        id:'I2_pgv_F9DE',
        title:'११ बर्षकी बालिकालाई ६० बर्षका पुरुषले...‘कुरा मिलाउन १० हजार अफर’? SP लाई प्रश्न- यो कस्तो लकडाउन ?',
        runtime:'41',
        datepublished:'2020-05-15',
      },
      {
        id:'4NxMY_S6ycM',
        title:'सानो जात भन्दै किरीया बस्न नदिएको आरोप, २ पक्रा*उ । सांसदको बिबादीत भनाई, सासंद थापासंग सिधा सवाल',
        runtime:'36',
        datepublished:'2020-05-08',
      },
      {
        id:'rKeStsfChY8',
        title:'मुख्यमन्त्रीलाई प्रश्न : लकडाउन अब के हुन्छ ? बिदेश रहेकालाई नेपाल ल्याउने हो ?राहत बितरण के पारा हो',
        runtime:'29',
        datepublished:'2020-04-17',
      },
      {
        id:'QK3gy9ctmzw',
        title:'प्रहरीको तलव किन घटाएको ? डाक्टर, नर्सलाई के गरेको ? लकडाउन कहिले सम्म ? Personal Opinion | Apil |',
        runtime:'11',
        datepublished:'2020-04-10',
      },
      {
        id:'ukMrbmCN7',
        title:'‘पोखरामा भेटीए संक्रमित !’ ‘पोखरामा पोजेटिभ, काठमाडौमा नेगेटिभ ?’ हल्लाहरुको यस्तो हो बास्तबिकता',
        runtime:'20',
        datepublished:'2020-04-04',
      },
      {
        id:'ek1BzY_2mC8',
        title:'पोखरामा को+रोना माथी गम्भीर लापरवाही | ज्वरो पनी नाप्दैन सरकारी अस्पताल | कहा छ लकडाउन ?',
        runtime:'43',
        datepublished:'2020-03-27',
      },
      {
        id:'WfILUnFOr2E',
        title:'श्रीमान बिदेशमा, देवरले भाउजुलाई बला...आ रोप। मुख्यमन्त्रीको सम्पत्ती :५१ तोला सुन, ९ भेडा, ७ बाख्रा',
        runtime:'39',
        datepublished:'2020-03-20',
      },
      {
        id:'M3oux6YZq7Y',
        title:'मन्त्रीहरुको सम्पत्ती कती ? २ महिनामा देखाउनुपर्ने २ बर्ष लुकाइयो ! पोखरामा को रोना भएको सांसदकोदाबी',
        runtime:'34',
        datepublished:'2020-03-13',
      },
      {
        id:'CrjAcv9LuYA',
        title:'एउटा अनौठो ठगि धन्दा | अमिताभ बच्चनको मान्छे भन्दै ठग्दै ! कोरोना त्रास: कार्यक्रम नगर्न CDOको सुचना',
        runtime:'46',
        datepublished:'2020-03-06',
      },

  ]
  let posts=[{
    title:'Where should i go to obtain my citizenship?',
    description:`" `,
    votes:20,
    comments:[
        {
            text:'CDO office',
            ownedby_id:'2',
            ownedby_name:'Bishnu Banstola',
            created_at:'2021-02-14'
        },
        {
            text:'And where is that office located?',
            ownedby_id:'3',
            ownedby_name:'Sabita Banstola',
            created_at:'2021-02-14'
        },
        {
          text:'Ratna Chowk',
          ownedby_id:'2',
          ownedby_name:'Bishnu Banstola',
          created_at:'2021-02-14'
      },
    ],
    likedby:['3','4','5'],
    ownedby_id:'4',
    ownedby_name:'Sabita Banstola',
    created_at:'2021-02-14',
}]
    let addVideo= async (video)=>{
            let result=await firebase.firestore().collection('posts').add(video)
            let result1=await firebase.firestore().collection('posts').add(video)
            return result1

        }
    return ( <div>
        {posts.map(video=>addVideo(video))}
    </div> );
}
 
export default WordsAdd;

